Тестовая конфа/src/Documents/Звонок/Звонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Звонок</name>
  <posting>Deny</posting>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗвонка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокСНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Document>

Тестовая конфа/src/Documents/Звонок/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ЗаполнитьМенюПодчиненнымиДокументамиИВыбрать(Док)
	Меню = Новый СписокЗначений;
	Меню.Добавить("СоздатьЗаявку", "< Создать заявку >");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СтруктураПодчиненности.Ссылка КАК док,
		|	СтруктураПодчиненности.Ссылка.Представление как Представление
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&Док) КАК СтруктураПодчиненности";

	Запрос.УстановитьПараметр("Док", Док);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			Меню.Добавить(Выборка.Док, Выборка.Представление);
		КонецЦикла;
	КонецЕсли;
	Возврат Меню;
КонецФункции

&НаКлиенте
Процедура СоздатьЗаявку()
	Записать();
	Док = ПолучитьФорму("Документ.Заявка.Форма.ФормаДокумента");
	Док.Объект.Контрагент = Объект.Контрагент;
	Док.Объект.ТекстЗаявки = Объект.ТекстЗвонка;
	Док.Объект.ДокОснование = Объект.Ссылка;
	Док.Объект.КонтактноеЛицо = Объект.КонтактноеЛицо;
	Док.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыборСозданойЗаявки(ВыбранныйПункт, Параметры) Экспорт
	Если ВыбранныйПункт.Значение = "СоздатьЗаявку" Тогда
		СоздатьЗаявку();
		Закрыть();
	Иначе
		Парам = Новый Структура("КлючЗначения", ВыбранныйПункт.Значение);
		ОткрытьФорму("Документ.Заявка.ФормаОбъекта", Парам, , , , , , РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеЗаявки(Команда)
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;

	Меню = ЗаполнитьМенюПодчиненнымиДокументамиИВыбрать(Объект.Ссылка);
	Если Меню.Количество() > 1 Тогда
		Меню.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыборСозданойЗаявки", ЭтотОбъект));
	Иначе
		СоздатьЗаявку();
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

	ЗадармаДанныеЗвонка = ПлюсЗадарма.ПолучитьДанныеЗвонка(Объект.ИД);
	Если ЗадармаДанныеЗвонка = Неопределено Тогда
		Элементы.ЗадармаОписаниеЗвонка.Видимость = ложь;
	Иначе
		ЗадармаОписаниеЗвонка = "Звонок: "
			+ ?(ЗадармаДанныеЗвонка.ЭтоВходящий, "входящий с номера", "исходящий на номер")
			+ " " + ЗадармаДанныеЗвонка.НомерВнешний + Символы.ПС
			+ "Звонок обработал: " + ЗадармаДанныеЗвонка.НомерВнутренний + " ("
			+ ЗадармаДанныеЗвонка.ПринялЗвонок + ")" "Совершен: "
			+ ЗадармаДанныеЗвонка.ВремяНачалаЗвонка + Символы.ПС + "Длительность: "
			+ ЗадармаДанныеЗвонка.Длительность + Символы.ПС + "Состояние звонка: "
			+ ЗадармаДанныеЗвонка.СостояниеЗвонка
			+ ?(ЗадармаДанныеЗвонка.ЕстьЗаписьРазговора, Символы.ПС
			+ "Есть запись разговора", "");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТекущийЭлемент = Элементы.ТекстЗвонка;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Предупреждение("Не найден контрагент, выбирите существующего контрагента или создайте нового.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьЗвонки", Неопределено, Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
